import styles from "./footer.module.css";
import BriefIcon from "../../assets/icons/briefcase.svg";
const Footer = () => {
  return (
    <>
      <div className={styles.container}>
        <div className={styles.item2}>
          <h1>راه های ارتباطی</h1>
          <p>تلفن تماس: +۹۸۹۱۲۱۲۱۲۱۲۱</p>
          <p> آدرس ایمیل: info@hamsafar.ir</p>
          <div className={styles.fl2}>
            <svg
              width="36"
              height="36"
              viewBox="0 0 36 36"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <g clip-path="url(#clip0_497_502)">
                <path
                  d="M34.0904 4.90454C32.6724 5.90474 31.1024 6.66974 29.4409 7.17007C28.5491 6.14467 27.3639 5.4179 26.0456 5.08804C24.7273 4.75818 23.3395 4.84116 22.0699 5.32574C20.8003 5.81032 19.7101 6.67313 18.9469 7.79748C18.1836 8.92183 17.7841 10.2535 17.8023 11.6123V13.093C15.2001 13.1605 12.6216 12.5834 10.2964 11.413C7.97128 10.2427 5.97165 8.51552 4.47564 6.38528C4.47564 6.38528 -1.44732 19.7119 11.8793 25.6349C8.82979 27.7049 5.19699 28.7428 1.51416 28.5964C14.8408 36 31.1289 28.5964 31.1289 11.5679C31.1276 11.1554 31.0879 10.744 31.0105 10.3388C32.5217 8.84848 33.5882 6.96678 34.0904 4.90454Z"
                  stroke="#BEBEBE"
                  stroke-width="3.71429"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                />
              </g>
              <defs>
                <clipPath id="clip0_497_502">
                  <rect
                    width="35.5377"
                    height="35.5377"
                    fill="white"
                    transform="translate(0.0336914 0.462158)"
                  />
                </clipPath>
              </defs>
            </svg>

            <svg
              width="42"
              height="42"
              viewBox="0 0 42 42"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M29.6527 3.99414H12.3774C7.60695 3.99414 3.73975 7.86134 3.73975 12.6318V29.9071C3.73975 34.6775 7.60695 38.5447 12.3774 38.5447H29.6527C34.4231 38.5447 38.2903 34.6775 38.2903 29.9071V12.6318C38.2903 7.86134 34.4231 3.99414 29.6527 3.99414Z"
                stroke="#BEBEBE"
                stroke-width="4.33333"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
              <path
                d="M27.9252 20.1814C28.1384 21.6192 27.8928 23.0875 27.2234 24.3776C26.554 25.6677 25.4948 26.7139 24.1965 27.3674C22.8983 28.0208 21.427 28.2483 19.992 28.0174C18.557 27.7865 17.2314 27.109 16.2036 26.0812C15.1759 25.0535 14.4984 23.7278 14.2675 22.2928C14.0365 20.8579 14.264 19.3866 14.9175 18.0883C15.5709 16.79 16.6171 15.7309 17.9072 15.0615C19.1973 14.392 20.6657 14.1465 22.1034 14.3597C23.5699 14.5771 24.9277 15.2605 25.976 16.3088C27.0243 17.3572 27.7077 18.7149 27.9252 20.1814Z"
                stroke="#BEBEBE"
                stroke-width="4.33333"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
              <path
                d="M30.5161 11.7681H30.5322"
                stroke="#BEBEBE"
                stroke-width="4.33333"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
            </svg>
            <svg
              width="37"
              height="37"
              viewBox="0 0 37 37"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <g clip-path="url(#clip0_497_495)">
                <path
                  d="M33.8735 10.007C33.6976 9.30423 33.3394 8.66035 32.835 8.14036C32.3306 7.62038 31.6979 7.24271 31.0009 7.04549C28.454 6.42358 18.2665 6.42358 18.2665 6.42358C18.2665 6.42358 8.07903 6.42358 5.53216 7.10472C4.8351 7.30194 4.20242 7.67961 3.69804 8.19959C3.19365 8.71958 2.83542 9.36346 2.65953 10.0662C2.19341 12.6509 1.96541 15.2729 1.97839 17.8993C1.96177 20.5455 2.18979 23.1875 2.65953 25.7916C2.85344 26.4726 3.2197 27.0919 3.72291 27.59C4.22612 28.088 4.84927 28.4478 5.53216 28.6347C8.07903 29.3158 18.2665 29.3158 18.2665 29.3158C18.2665 29.3158 28.454 29.3158 31.0009 28.6347C31.6979 28.4374 32.3306 28.0598 32.835 27.5398C33.3394 27.0198 33.6976 26.3759 33.8735 25.6732C34.336 23.1079 34.564 20.5059 34.5546 17.8993C34.5712 15.2532 34.3432 12.6111 33.8735 10.007Z"
                  stroke="#BEBEBE"
                  stroke-width="3.71429"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                />
                <path
                  d="M14.9346 22.7414L23.4488 17.8994L14.9346 13.0574V22.7414Z"
                  stroke="#BEBEBE"
                  stroke-width="3.71429"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                />
              </g>
              <defs>
                <clipPath id="clip0_497_495">
                  <rect
                    width="35.5377"
                    height="35.5377"
                    fill="white"
                    transform="translate(0.497559 0.500732)"
                  />
                </clipPath>
              </defs>
            </svg>
            <svg
              width="37"
              height="37"
              viewBox="0 0 37 37"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M24.4411 12.3467C26.7974 12.3467 29.0572 13.2827 30.7233 14.9489C32.3895 16.615 33.3255 18.8748 33.3255 21.2311V31.5963H27.4025V21.2311C27.4025 20.4457 27.0905 19.6924 26.5351 19.137C25.9798 18.5816 25.2265 18.2696 24.4411 18.2696C23.6556 18.2696 22.9024 18.5816 22.347 19.137C21.7916 19.6924 21.4796 20.4457 21.4796 21.2311V31.5963H15.5566V21.2311C15.5566 18.8748 16.4927 16.615 18.1588 14.9489C19.825 13.2827 22.0848 12.3467 24.4411 12.3467Z"
                stroke="#BEBEBE"
                stroke-width="3.71429"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
              <path
                d="M9.6334 13.8274H3.71045V31.5963H9.6334V13.8274Z"
                stroke="#BEBEBE"
                stroke-width="3.71429"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
              <path
                d="M6.67193 9.38511C8.3075 9.38511 9.6334 8.05921 9.6334 6.42363C9.6334 4.78806 8.3075 3.46216 6.67193 3.46216C5.03635 3.46216 3.71045 4.78806 3.71045 6.42363C3.71045 8.05921 5.03635 9.38511 6.67193 9.38511Z"
                stroke="#BEBEBE"
                stroke-width="3.71429"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
            </svg>
            <svg
              width="36"
              height="36"
              viewBox="0 0 36 36"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M32.5762 3.42383L16.2881 19.7119"
                stroke="#BEBEBE"
                stroke-width="3.71429"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
              <path
                d="M32.5762 3.42383L22.211 33.0386L16.2881 19.7119L2.96143 13.789L32.5762 3.42383Z"
                stroke="#BEBEBE"
                stroke-width="3.71429"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
            </svg>
          </div>
        </div>

        <div className={styles.item1}>
          <h1>همسفر شوید</h1>
          <p>ارائه خدمت</p>
          <p>همکاران همسفر</p>
        </div>

        <div className={styles.item1}>
          <a href="/">
            <button className={styles.logoBtn}>همسفر</button>
          </a>
          <p>
            لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
            استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در
            ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و
            کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی
            در شصت و سه درصد گذشته حال و آینده
          </p>
        </div>
      </div>
    </>
  );
};

export default Footer;
